; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v8)
		(pred_6 ?v7)
		(pred_2 ?v1)
		(pred_3 ?v1)
		(pred_1 ?v7 ?v1)
		(pred_4)
		(pred_5 ?v7))

   (:action op_3
       :parameters  (?v3 ?v4)
       :precondition (and (not-eq ?v3 ?v4) 
                          (pred_2 ?v3) (pred_2 ?v4) (pred_3 ?v3))
       :effect (and  (pred_3 ?v4)
		     (not (pred_3 ?v3))))


   (:action op_2
       :parameters (?v6 ?v5)
       :precondition  (and  (pred_6 ?v6) (pred_2 ?v5)
			    (pred_1 ?v6 ?v5) (pred_3 ?v5) (pred_4))
       :effect (and (pred_5 ?v6)
		    (not (pred_1 ?v6 ?v5)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v6  ?v5)
       :precondition  (and  (pred_6 ?v6) (pred_2 ?v5)
			    (pred_5 ?v6) (pred_3 ?v5))
       :effect (and (pred_1 ?v6 ?v5)
		    (pred_4)
		    (not (pred_5 ?v6)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_05 obj_03 obj_06 
          obj_04 obj_01 obj_02 
)
(:init
(pred_2 obj_05)
(pred_2 obj_03)
(pred_2 obj_06)
(pred_6 obj_04)
(pred_6 obj_01)
(pred_6 obj_02)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(pred_4)
(pred_1 obj_04 obj_03)
(pred_1 obj_01 obj_03)
(pred_1 obj_02 obj_06)
(pred_3 obj_05)
)
(:goal
(and
(pred_1 obj_04 obj_06)
(pred_1 obj_01 obj_03)
(pred_1 obj_02 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_04 obj_06) (pred_3 obj_05))
    (sometime-before  (pred_1 obj_02 obj_05) (pred_3 obj_03))
  )
)
)

; plan
1. (op_3 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_03)
   goals met: 1 of 3
2. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04 obj_03) (pred_4)
   added: (pred_5 obj_04)
   goals met: 1 of 3
3. (op_3 obj_03 obj_06)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_06)
   goals met: 1 of 3
4. (op_1 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_1 obj_04 obj_06) (pred_4)
   goals met: 2 of 3
5. (op_2 obj_02 obj_06)
   deleted: (pred_1 obj_02 obj_06) (pred_4)
   added: (pred_5 obj_02)
   goals met: 2 of 3
6. (op_3 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_05)
   goals met: 2 of 3
7. (op_1 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_1 obj_02 obj_05) (pred_4)
   goals met: 3 of 3
